In [1]:
import pandas as pd
import numpy as np

In [2]:
data=np.random.randn(4,3)

In [3]:
data

array([[-0.90367072,  0.81716587,  0.97855413],
       [ 1.43402237, -1.58379246,  1.02669085],
       [-0.07974774,  0.97523991, -0.36980457],
       [-0.05343914, -0.16118364,  0.20879093]])

In [4]:
dataFrame=pd.DataFrame(data)

In [5]:
type(dataFrame[0])

pandas.core.series.Series

In [6]:
dataFrame

          0         1         2
0 -0.903671  0.817166  0.978554
1  1.434022 -1.583792  1.026691
2 -0.079748  0.975240 -0.369805
3 -0.053439 -0.161184  0.208791

In [7]:
yeniDataFrame=pd.DataFrame(data,index=["ayhan","arda","demir","kaya"],columns=["maas","yas","saat"])

In [8]:
yeniDataFrame

           maas       yas      saat
ayhan -0.903671  0.817166  0.978554
arda   1.434022 -1.583792  1.026691
demir -0.079748  0.975240 -0.369805
kaya  -0.053439 -0.161184  0.208791

In [9]:
yeniDataFrame["yas"]

ayhan    0.817166
arda    -1.583792
demir    0.975240
kaya    -0.161184
Name: yas, dtype: float64

In [10]:
yeniDataFrame["saat"]

ayhan    0.978554
arda     1.026691
demir   -0.369805
kaya     0.208791
Name: saat, dtype: float64

In [11]:
yeniDataFrame[["maas","yas"]]

           maas       yas
ayhan -0.903671  0.817166
arda   1.434022 -1.583792
demir -0.079748  0.975240
kaya  -0.053439 -0.161184

In [12]:
yeniDataFrame.loc["ayhan"]

maas   -0.903671
yas     0.817166
saat    0.978554
Name: ayhan, dtype: float64

In [13]:
yeniDataFrame.loc["arda"]

maas    1.434022
yas    -1.583792
saat    1.026691
Name: arda, dtype: float64

In [14]:
yeniDataFrame.iloc[1]

maas    1.434022
yas    -1.583792
saat    1.026691
Name: arda, dtype: float64

In [15]:
yeniDataFrame

           maas       yas      saat
ayhan -0.903671  0.817166  0.978554
arda   1.434022 -1.583792  1.026691
demir -0.079748  0.975240 -0.369805
kaya  -0.053439 -0.161184  0.208791

In [16]:
yeniDataFrame["maas"]

ayhan   -0.903671
arda     1.434022
demir   -0.079748
kaya    -0.053439
Name: maas, dtype: float64

In [17]:
yeniDataFrame["emeklik yas"]=yeniDataFrame['yas']+yeniDataFrame['yas']

In [18]:
yeniDataFrame

           maas       yas      saat  emeklik yas
ayhan -0.903671  0.817166  0.978554     1.634332
arda   1.434022 -1.583792  1.026691    -3.167585
demir -0.079748  0.975240 -0.369805     1.950480
kaya  -0.053439 -0.161184  0.208791    -0.322367

In [19]:
yeniDataFrame.drop("emeklik yas",axis=1)

           maas       yas      saat
ayhan -0.903671  0.817166  0.978554
arda   1.434022 -1.583792  1.026691
demir -0.079748  0.975240 -0.369805
kaya  -0.053439 -0.161184  0.208791

In [20]:
yeniDataFrame.drop("demir",axis=0)

           maas       yas      saat  emeklik yas
ayhan -0.903671  0.817166  0.978554     1.634332
arda   1.434022 -1.583792  1.026691    -3.167585
kaya  -0.053439 -0.161184  0.208791    -0.322367

In [21]:
yeniDataFrame.drop("emeklik yas",axis=1,inplace=True)

In [22]:
yeniDataFrame

           maas       yas      saat
ayhan -0.903671  0.817166  0.978554
arda   1.434022 -1.583792  1.026691
demir -0.079748  0.975240 -0.369805
kaya  -0.053439 -0.161184  0.208791

In [23]:
yeniDataFrame.loc["ayhan"]["yas"]

0.8171658650935089

In [24]:
yeniDataFrame.loc["demir","yas"]

0.9752399054536633

In [25]:
yeniDataFrame

           maas       yas      saat
ayhan -0.903671  0.817166  0.978554
arda   1.434022 -1.583792  1.026691
demir -0.079748  0.975240 -0.369805
kaya  -0.053439 -0.161184  0.208791

In [26]:
booleanFrame=yeniDataFrame<0

In [27]:
booleanFrame

        maas    yas   saat
ayhan   True  False  False
arda   False   True  False
demir   True  False   True
kaya    True   True  False

In [28]:
yeniDataFrame[booleanFrame]

           maas       yas      saat
ayhan -0.903671       NaN       NaN
arda        NaN -1.583792       NaN
demir -0.079748       NaN -0.369805
kaya  -0.053439 -0.161184       NaN

In [29]:
yeniDataFrame[yeniDataFrame<0]

           maas       yas      saat
ayhan -0.903671       NaN       NaN
arda        NaN -1.583792       NaN
demir -0.079748       NaN -0.369805
kaya  -0.053439 -0.161184       NaN

In [30]:
yeniDataFrame[yeniDataFrame["yas"]>0]

           maas       yas      saat
ayhan -0.903671  0.817166  0.978554
demir -0.079748  0.975240 -0.369805

In [31]:
yeniDataFrame[yeniDataFrame["saat"]>0]

           maas       yas      saat
ayhan -0.903671  0.817166  0.978554
arda   1.434022 -1.583792  1.026691
kaya  -0.053439 -0.161184  0.208791

In [32]:
yeniDataFrame

           maas       yas      saat
ayhan -0.903671  0.817166  0.978554
arda   1.434022 -1.583792  1.026691
demir -0.079748  0.975240 -0.369805
kaya  -0.053439 -0.161184  0.208791

In [33]:
yeniDataFrame.reset_index()

   index      maas       yas      saat
0  ayhan -0.903671  0.817166  0.978554
1   arda  1.434022 -1.583792  1.026691
2  demir -0.079748  0.975240 -0.369805
3   kaya -0.053439 -0.161184  0.208791

In [34]:
yeniDataFrame

           maas       yas      saat
ayhan -0.903671  0.817166  0.978554
arda   1.434022 -1.583792  1.026691
demir -0.079748  0.975240 -0.369805
kaya  -0.053439 -0.161184  0.208791

In [35]:
yeniDataFrame

           maas       yas      saat
ayhan -0.903671  0.817166  0.978554
arda   1.434022 -1.583792  1.026691
demir -0.079748  0.975240 -0.369805
kaya  -0.053439 -0.161184  0.208791

In [36]:
yeniIndexlistesi=["ayh","ard","dem","kay"]

In [37]:
yeniDataFrame["yeni indeks"]=yeniIndexlistesi

In [38]:
yeniDataFrame

           maas       yas      saat yeni indeks
ayhan -0.903671  0.817166  0.978554         ayh
arda   1.434022 -1.583792  1.026691         ard
demir -0.079748  0.975240 -0.369805         dem
kaya  -0.053439 -0.161184  0.208791         kay

In [39]:
yeniDataFrame.set_index("yeni indeks")

                 maas       yas      saat
yeni indeks
ayh         -0.903671  0.817166  0.978554
ard          1.434022 -1.583792  1.026691
dem         -0.079748  0.975240 -0.369805
kay         -0.053439 -0.161184  0.208791

In [40]:
yeniDataFrame.set_index("yeni indeks",inplace=True)

In [41]:
yeniDataFrame

                 maas       yas      saat
yeni indeks
ayh         -0.903671  0.817166  0.978554
ard          1.434022 -1.583792  1.026691
dem         -0.079748  0.975240 -0.369805
kay         -0.053439 -0.161184  0.208791

In [42]:
yeniDataFrame.loc["ayh"]

maas   -0.903671
yas     0.817166
saat    0.978554
Name: ayh, dtype: float64

In [43]:
oneIndexler=["simpson","simpson","simpson","southpark","southpark","southpark"]

In [44]:
icIndexler=["homer","bart","marge","cartman","kenny","kyle"]

In [45]:
birlesmisIndeks=list(zip(oneIndexler,icIndexler))

In [46]:
birlesmisIndeks

[('simpson', 'homer'),
 ('simpson', 'bart'),
 ('simpson', 'marge'),
 ('southpark', 'cartman'),
 ('southpark', 'kenny'),
 ('southpark', 'kyle')]

In [47]:
birlesmisIndeks=pd.MultiIndex.from_tuples(birlesmisIndeks)

In [48]:
type(birlesmisIndeks)

pandas.core.indexes.multi.MultiIndex

In [49]:
birlesmisIndeks

MultiIndex([(  'simpson',   'homer'),
            (  'simpson',    'bart'),
            (  'simpson',   'marge'),
            ('southpark', 'cartman'),
            ('southpark',   'kenny'),
            ('southpark',    'kyle')],
           )

In [50]:
benimcizgiflmliste=[[40,"a"],[10,"b"],[29,"c"],[40,"d"],[9,"e"],[9,"f"]]

In [51]:
cizgiflmnumpydizi=np.array(benimcizgiflmliste)

In [52]:
cizgiflmDataFrame=pd.DataFrame(cizgiflmnumpydizi,index=birlesmisIndeks,columns=["yas","meslek"])

In [53]:
cizgiflmDataFrame

                  yas meslek
simpson   homer    40      a
          bart     10      b
          marge    29      c
southpark cartman  40      d
          kenny     9      e
          kyle      9      f

In [54]:
cizgiflmDataFrame.loc["simpson"]

      yas meslek
homer  40      a
bart   10      b
marge  29      c

In [55]:
cizgiflmDataFrame.loc["southpark"].loc["kenny"]

yas       9
meslek    e
Name: kenny, dtype: object

In [56]:
cizgiflmDataFrame.index.names=["film adi","isim"]

In [58]:
cizgiflmDataFrame

                  yas meslek
film adi  isim
simpson   homer    40      a
          bart     10      b
          marge    29      c
southpark cartman  40      d
          kenny     9      e
          kyle      9      f